
UNKNOWN_USER = "Ты еще кто? нажми /start"
NOT_ALLOWED_MESSAGE = "Че-то тут не то написано"

START_PLAYER = """Здарова бандиты, вас приветствует Супер тайный жмых. 

Всё очень просто - тыкайте на кнопочки и если повезёт - под ёлкой вы найдёте свою ректальную свечку или игрушечную гитару.

Для начала выберите как вас звать
"""
ALREADY_STARTED = "Ты уже начал игру в этом году, назад пути нет"

INCORRECT_NICKNAME = "лее брат выбери нормальный ник"
def NICK_SELECTED(nickname: str) -> str:
    return f"Твой ник: {nickname}. Теперь выбирай че дарить"


WISHLIST_SELECTED = "Кринжанул, спасибо. Теперь жди начала игры"
NO_WISHLIST_YET = "Кажется у тебя не вишлиста"

NO_PLAYERS_YET = "Кажется еще никто не зарегался, начни сам: /start"
