
UNKNOWN_USER = "Ты еще кто? нажми /start"
NOT_ALLOWED_MESSAGE = "Че-то тут не то написано"

START_PLAYER = """Здарова бандиты, вас приветствует Супер тайный жмых. 

Всё очень просто - тыкайте на кнопочки и если повезёт - под ёлкой вы найдёте свою ректальную свечку или игрушечную гитару.

Для начала выберите как вас звать
"""
ALREADY_STARTED = "Ты уже начал игру в этом году, назад пути нет"

INCORRECT_NICKNAME = "лее брат выбери нормальный ник"
def NICK_SELECTED(nickname: str) -> str:
    return f"Твой ник: {nickname}. Теперь выбирай че дарить"


WISHLIST_SELECTED = "Кринжанул, спасибо. Теперь жди начала игры, а пока лови юмореску"
NO_WISHLIST_YET = "Кажется у тебя не вишлиста"

NO_PLAYERS_YET = "Кажется еще никто не зарегался, начни сам: /start"

ANEKI = [
    """Рабинович продаёт на Привозе арбузы под табличкой "Один арбуз - 3 рубля. Три арбуза - 10 рублей".

Подходит мужик и покупает арбуз за три рубля, потом ещё один арбуз по три рубля, потом ещё один арбуз по три рубля - и на прощанье радостно говорит Рабиновичу:

—Смотри, я купил три арбуза, а заплатил только 9 рублей! Не умеешь торговать!

Рабинович смотрит ему вслед:

—Один арбуз отравлен""",

    """Идyт по лeсy мeдведь и заяц, смотрят, сидит на тропинке лягушка и говорит: 
— Я лягушкa не простая, а волшебная, могу исполнить ваши три желания. 
Медведь пoдумал и говорит: 
— Я хочу, чтобы все медведи в нашем лесу стали женщинами... 
— Твое желание исполнено. Ну а ты, заяц, чего желаешь? 
Заяц думал некоторое время, и говорит: 
— А я хочу мото-шлем. 
Перед ним появляется шлем. 
— Твое второе желание, медведь. 
— Я хочу, чтобы все медведи в соседнем лесу стали женщинами. 
— Tвоe жeлaниe исполнено. Теперь ты, заяц, загадывай. 
— Ну, а я хочу мотоцикл. 
Перед ним появляется крутой мотоцикл. Медведь удивленно косится на зайца: 
— Ты чего тратишь желания на всякую ерунду? Поди, не каждый день лягушку волшебницу встречаешь, идиот. 
— Твое последнее желание, медведь. 
— Я хочу, чтобы все медведи во всем мире стали женщинами. 
— ахахахахаха а чё ты сразу не пожелал чтобы все медведи стали женщинами, ебать ты лох медведь, ещё и на меня гнал, лягушка, дай мозги этому ебанату""",

    """Зайца приговорили к смертной казни через съедение стаей волков
Судья медведь спрашивает:
-ваше последнее желание?
Заяц покосился на стаю волков и спросил:
-я могу поесть перед смертью?
-конечно, что будете есть?
-стаю волков""",

    """Идёт заяц по лесу, жуёт жвачку. Навстречу ему волк: 
– Заяц, дай жвачку. 
– Хорошо, только ответь сначала на мои вопросы. 
– Давай. 
– Когда война была? 
– В 1941-1945. 
– Кто её начал, кто закончил? 
– Гитлер начал, Сталин закончил. 
– Сколько звёзд на небе? 
– Не знаю, учёные ещё не посчитали. 
Заяц дал ему жвачку, идёт волк по лесу, жуёт. Навстречу ему медведь: 
– Волк, дай жвачку. 
– Иди у зайца попроси. Главное – запомни: 1941-1945, Гитлер начал, Сталин закончил, учёные ещё не определили. 
Медведь подходит к зайцу: 
– Заяц, дай жвачку. 
– АААА БЛЯТЬ ГОВОРЯЩИЙ МЕДВЕДЬ!!!""",

    """Идyт по лeсy мeдведь и заяц, смотрят, сидит на тропинке лягушка и говорит: 
— Я лягушкa не простая, а волшебная, могу исполнить ваши три желания. 
Медведь пoдумал и говорит: 
— Я хочу, чтобы все медведи в нашем лесу стали женщинами... 
— Твое желание исполнено. Ну а ты, заяц, чего желаешь? 
Заяц думал некоторое время, и говорит: 
— А я хочу кучу голых негров с огромными елдами. 
Перед ним появляется рота накаченных негров.
— Твое второе желание, медведь. 
— Я хочу, чтобы все медведи в соседнем лесу стали женщинами. 
— Tвоe жeлaниe исполнено. Теперь ты, заяц, загадывай. 
— Хочу кожанный диван.
Перед Медведь удивленно косится на зайца: 
— Ты чего тратишь желания на всякую ерунду? Поди, не каждый день лягушку волшебницу встречаешь, идиот. 
— Твое последнее желание, медведь. 
— Я хочу, чтобы все медведи во всем мире стали женщинами. 
— Уже стали. А ты чего хочешь, заяц? 
Заяц садится посреди своих новых друзей на диван, откидывается и говорит. 
- Включай Евангелион!""",

    """Еврейская семья собирает корзинку с пирожками еврейской Красной Шапочке и даёт ей напутствия: 
- Таки слушай сюда. Когда ты придёшь до бабушки, она сразу тебе таки будет плакаться, что, ой вэй, зима совсем скоро, из щелей дует, кран подтекает, топить нечем, крыша прохудилась, денег нет совершенно и вообще, шо ты, внучка, знаешь за эту жизнь. Но ты таки ничего не слушай, а твёрдо стой на своём: один пирожок - 3 рубля, три пирожка - 10 рублей.""",

    """Едет мужик в автобусе с расстегнутой ширинкой. Женщина напротив заметила, вертелась-вертелась, думая, как бы поделикатней ему об этом сказать, наконец не выдержала и шепотом:
-Мужчина, у Вас магазин открыт.
Мужик быстренько устранил неполадку и думает- не было ли там чего видно. Думал-думал, как бы поделикатней спросить, и наконец не выдержал:
-Я извиняюсь, женщина, а там директора видно не было?
-Директора видно не было, а вот пьяный грузчик на двух мешках валялся."""

]